Revit 2024 API
Wood.WoodColor2 Property
 The property labeled "Color 2" from the "Wood" schema.
Namespace: Autodesk.Revit.DB.Visual
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2018.1
Syntax
C#
public static string WoodColor2 { get; }
Visual Basic
Public Shared ReadOnly Property WoodColor2 As String
	Get
Visual C++
public:
static property String^ WoodColor2 {
	String^ get ();
}
Remarks
 This property is of type "AssetPropertyDoubleArray4d". This property allows a connected asset.
See Also
Wood Class
Autodesk.Revit.DB.Visual Namespace